// middleLetter : { beforeLetter: { afterLetter: "a" } }

module.exports = {
  ب: {
    ك: {
      ر: "a",
    },
    ع: {
      ر: "a",
    },
    خ: {
      ر: "a",
    },
    ص: {
      ا: "a",
    },
  },

  ز: {
    ا: {
      ل: "a",
    },
    ع: {
      ت: "a",
    },
  },
  ي: {
    د: {
      ن: "e",
    },
    ش: {
      ت: "e",
      ن: "e",
      م: "e",
      ح: "e",
    },
    ت: {
      ش: "e",
      ن: "e",
      م: "e",
      ح: "e",
    },
  },
  ه: {
    ن: {
      ر: "u",
    },
  },

  ر: {
    ج: {
      ح: "a",
    },
    ح: {
      ج: "a",
    },
  },
  م: {
    ح: {
      د: "a",
    },
  },
  ي: {
    ن: {
      ن: "e",
    },
  },

  د: {
    خ: {
      ر: "a",
    },
    ا: {
      ق: "i",
    },
    ع: {
      ي: "a",
    },
    ا: {
      م: "a",
    },
    أ: {
      م: "a",
    },
    آ: {
      م: "a",
    },
  },

  ض: {
    خ: {
      ر: "i",
    },
  },
  ف: {
    ر: {
      ل: "a",
    },
    ا: {
      ي: "i",
    },
  },
  ب: {
    ز: {
      ا: "a",
    },
  },

  م: {
    ز: {
      ن: "a",
    },
  },
  ن: {
    ا: {
      س: "a",
      ي: "e",
    },
    أ: {
      س: "a",
      ي: "e",
    },
    إ: {
      س: "e",
      ي: "e",
    },
    س: {
      د: "a",
    },
  },
  ح: {
    ا: {
      ب: "i",
    },
    س: {
      ر: "a",
    },
  },

  ل: {
    ع: {
      ا: "a",
      ك: "a",
      م: "a",
      ش: "a",
      ق: "a",
    },
  },

  ه: {
    ا: {
      ر: "i",
    },
  },

  ج: {
    ع: {
      ب: "a",
      ر: "a",
    },
    ن: {
      ب: "a",
      ر: "a",
    },
  },

  ي: {
    ف: {
      ف: "e",
    },
  },
};
