module.exports = {
  م: {
    ح: "u",
    ث: "u",
    ص: "u",
    خ: "u",
    ر: "a",
    ه: "u",
    ق: "u",
    ع: "u",
    ك: "a",
  },
  س: {
    ه: "u",
    ن: "u",
    و: "a",
    ي: "a",
    ل: "a",
    ع: "a",
    ر: "u",
    د: "a",
    م: "a",
    ح: "a",
  },
  ن: {
    ب: "a",
    د: "a",
    ص: "a",
    ظ: "i",
    ه: "u",
  },
  ح: {
    س: "u",
    ي: "a",
    م: "a",
    ق: "a",
    ز: "u",
    ن: "a",
  },
  ر: {
    ح: "a",
    ف: "a",
    ب: "a",
    ض: "a",
  },
  ت: {
    ق: "u",
    ن: "i",
  },
  ز: {
    ه: "u",
    ي: "a",
    ن: "i",
  },
  غ: {
    ف: "u",
    م: "a",
  },
  ك: {
    م: "a",
    ر: "a",
    ل: "a",
  },
  د: {
    ع: "u",
    ر: "u",
  },
  ض: {
    ح: "u",
    ر: "u",
  },
  ق: {
    ي: "a",
  },
  ج: {
    د: "a",
    ب: "a",
  },
  ب: {
    د: "a",
  },
  ؤ: {
    ي: "a",
  },
  ط: {
    ن: "a",
    ي: "a",
  },
  خ: {
    ل: "a",
    ت: "i",
  },
  ي: {
    م: "a",
    ز: "a",
  },
  و: {
    ر: "o",
  },
  ه: {
    د: "a",
  },
  ش: {
    ه: "a",
  },
  ص: {
    د: "a",
    ر: "a",
    ف: "a",
    ك: "a",
    ن: "a",
    ه: "u",
  },
  ف: {
    ذ: "a",
    ن: "a",
    ر: "a",
    ض: "a",
  },

  ل: {
    م: "a",
    ي: "a",
  },
};
